Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/death_related_benefits/dependent_parents_pension.html.txt.tmx
Source language: en
Languages: ga

source: Death Benefits under the Occupational Injuries Scheme
ga: Sochair Bháis faoin Scéim um Shochair Dhíobhálacha Ceirde

source: • How to apply • Where to apply
ga: • Conas iarratas a dhéanamh

source: If a person dies because of an accident at work or occupational disease, Death Benefit (under the Occupational Injuries Scheme) may be paid to their surviving spouse or civil partner or dependent child
ga: Má fhaigheann duine bás de bharr timpiste ag an obair nó galar ceirde, d’fheadfaí Sochar Báis (faoin Scéim um Shochair Dhíobhálacha Ceirde) a íoc lena gcéile nó bpáirtnéir sibhialta marthanach nó lena gcleithiúnaí linbh

source: Death Benefit may also be paid if, at the time of their death, the person was getting a Disablement Pension assessed at 50% or more, regardless of the cause of death
ga: D’fhéadfaí Sochar Báis a íoc, chomh maith, ag tráth a mbáis, má bhí Pinsean Míchumais á fháil acu ar a ndéantar measúnú ar ráta 50% nó níos airde, gan aird ar chúis an bháis

source: The Death Benefit Scheme includes:
ga: Áirítear leis an Scéim um Shochar Báis:

source: • Widow's, Widower's or Surviving Civil Partner's Pension
ga: • Pinsean Baintrí, Baintreach Fir nó Páirtnéara Shibhialta Mharthanaigh

source: Widow's Widower's or Surviving Civil Partner's Pension
ga: Pinsean Baintrí, Baintreach Fir nó Páirtnéara Shibhialta Mharthanaigh

source: This is paid to the surviving spouse or civil partner of a person who died as a result of an accident at work, an occupational disease or who was getting a Disablement Pension asssessed as 50% or more at the time of their death
ga: Íoctar seo le céile nó le páirtnéir shibhialta marthanach duine a fuair bás mar thoradh ar thimpiste ag an obair, ar ghalar ceirde nó le duine ag a raibh Pinsean Míchumais á fháil ar a ndéantar measúnú ar ráta 50% nó níos airde, ag tráth a mbáis

source: You cannot get the pension if you remarry, enter into a civil partnership or cohabit with another person
ga: Ní féidir leat an pinsean a fháil má phóstar athuair thú, má iontrálann tú páirtnéireacht shibhialta nó má chomhchónaíonn tú le duine eile

source: The pension is not affected by any income you may have
ga: Ní dhéanann aon ioncam a d’fhéadfadh bheith agat difear don phinsean

source: Increases for qualified children are paid with the pension
ga: Íoctar méaduithe i leith leanaí cáilithe leis an bpinsean

source: The pension is taxable
ga: Gearrtar cáin ar an bpinsean

source: A Widow's Widower's or Surviving Civil Partner's Pension under the Death Benefit Scheme cannot be paid at the same time as a Widow's, Widower's or Surviving Civil Partner's Contributory Pension
ga: Ní féidir Pinsean Baintrí, Baintreach Fir nó Páirtnéara Shibhialta Mharthanaigh faoin Scéim um Shochar Báis a íoc ag an tráth céanna le Pinsean Ranníocach Baintrí, Baintreach Fir nó Páirtnéara Shibhialta Mharthanaigh

source: This is paid on behalf of a child if the parent, step-parent or person who supported the child died as a result of an accident at work, an occupational disease or was getting a Disablement Pension assessed as 50% or more at the time of their death
ga: Íoctar seo ar son linbh má fuair tuismitheoir, leastuismitheoir nó duine bás a chuir tacaíocht ar fáil don leanbh mar thoradh ar thimpiste ag an obair, ar ghalar ceirde nó más duine iad a raibh Pinsean Míchumais á fháil acu ar a ndéantar measúnú ar ráta 50% nó níos airde, ag tráth a mbáis

source: The orphan's guardian should apply for the payment
ga: Ba cheart do chaomhnóir an dílleachta iarratas a dhéanamh ar an íocaíocht

source: If the deceased person meets the conditions a special Funeral Grant can be paid to the person who pays for the funeral expenses
ga: Má shásaíonn an duine marbh na coinníollacha, féadfar Deontas Sochraide a íoc leis an duine a íocann as costais na sochraide

source: A Funeral Grant is not taxable
ga: Ní ghearrtar cáin ar Dheontas Sochraide

source: Payments under the Death Benefit Scheme are paid at higher rates than a standard Widow's, Widower's or Surviving Civil Partner's Contributory Pension or a Guardian's payment
ga: Íoctar íocaíochtaí faoin Scéim um Shochar Báis ar rátaí níos airde ná Pinsean Ranníocach Baintrí, Baintreach Fir nó Páirtnéara Shibhialta Mharthanaigh nó Íocaíocht Chaomhnóra

source: │Rate of payment from March 2017 │
ga: │Ráta íocaíochta ó Márta 2017 │

source: │Widow, widower or surviving civil partner (under 66) │€223.50 │
ga: │Baintreach, Baintreach Fir nó Páirtnéir Sibhialta Marthanach (faoi 66) │€223.50 │

source: │Widow, widower or surviving civil partner (over 66) │€242.70 │
ga: │Baintreach, Baintreach Fir nó Páirtnéir Sibhialta Marthanach (níos sine ná 66) │€242.70 │

source: │Widow, widower or surviving civil partner (over 80) │€252.70 │
ga: │Baintreach, Baintreach Fir nó Páirtnéir Sibhialta Marthanach (níos sine ná 80) │€252.70 │

source: │Increase for a Qualified Child │€29.80 │
ga: │Méadú i leith Leanbh Cáilithe │€29.80 │

source: │Orphan's Pension │€179.80 │
ga: │Pinsean Dílleachta │€179.80 │

source: │Funeral Grant (once-off lump sum) │€850.00 │
ga: │Deontas Sochraide (cnapshuim aonuaire) │€850.00 │

source: A claim for any of the payments under the Death Benefit Scheme should be made within 3 months of the date of death, otherwise you may lose some benefit
ga: Ba cheart éileamh a dhéanamh ar íocaíochtaí faoin Scéim um Shochar Báis laistigh de 3 mhí tar éis dháta an bháis, nó d’fhéadfá roinnt sochar a chailleadh

source: Complete claim form OB 61(pdf) which is available from your local social welfare office
ga: Comhlánaigh foirm éilimh OB 61(pdf) ar a bhfuil fáil ó d’oifig áitiúil leasa shóisialaigh

source: Send your completed claim form to the Death Benefit Section at the address below
ga: Seol d'fhoirm chomhlánaithe éilimh chuig an Rannóg um Shochar Báis ag an seoladh thíos
